
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.storage_account.time_rotating.rotate
* Update
  * module.storage_account.azurerm_storage_account.storage_account
* Replace
  * module.storage_account.time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/em-hrs-api-prod/providers/Microsoft.Storage/storageAccounts/emhrsapiprod"
        name                               = "emhrsapiprod"
        tags                               = {
            "application"         = "evidence-management"
            "builtFrom"           = "https://github.com/HMCTS/em-hrs-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "production"
            "managedBy"           = "Evidence Management"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 9 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2024-11-09T14:58:52Z" -> (known after apply)
      ~ minute  = 58 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-09T14:58:52Z" -> (known after apply) # forces replacement
      ~ second  = 52 -> (known after apply)
      ~ unix    = 1731164332 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-15T14:58:52Z"
      - rotation_rfc3339 = "2024-11-09T14:58:52Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":2139,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->